In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('./Dataset salary 2024.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,SE,FT,AI Engineer,202730,USD,202730,US,0,US,M
1,2024,SE,FT,AI Engineer,92118,USD,92118,US,0,US,M
2,2024,SE,FT,Data Engineer,130500,USD,130500,US,0,US,M
3,2024,SE,FT,Data Engineer,96000,USD,96000,US,0,US,M
4,2024,SE,FT,Machine Learning Engineer,190000,USD,190000,US,0,US,M

In [3]:
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16534 entries, 0 to 16533
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           16534 non-null  int64
 1   experience_level    16534 non-null  object
 2   employment_type     16534 non-null  object
 3   job_title           16534 non-null  object
 4   salary              16534 non-null  int64
 5   salary_currency     16534 non-null  object
 6   salary_in_usd       16534 non-null  int64
 7   employee_residence  16534 non-null  object
 8   remote_ratio        16534 non-null  int64
 9   company_location    16534 non-null  object
 10  company_size        16534 non-null  object
dtypes: int64(4), object(7)
memory usage: 1.4+ MB

# EDA

### Categorical Data

1. Extract Categorical columns

In [7]:
categorical_cols = [col for col in df.columns if df[col].dtype=='object']
categorical_cols

['experience_level',
 'employment_type',
 'job_title',
 'salary_currency',
 'employee_residence',
 'company_location',
 'company_size']

In [11]:

for col in categorical_cols:
    print(col,df[col].nunique())
    # print(df[col].value_counts())

experience_level 4
employment_type 4
job_title 155
salary_currency 23
employee_residence 88
company_location 77
company_size 3

except experience level ,employment types and compnay size , all columns have many categories

Nomial categories (No Order):

    - employment type : full time (ft),part time(pt),contract {ct},freeelance (FL) which dont make snese in order

    - job titles we have many job roles

    - employee residence is also nomial which has different places info

    - company location , alos nomial data

    - salary currency cod is nomial

Ordinal data (order):

    - experience level has order , Entry level (EN), Mid Level (MI), Senior level (SE), Executive level (EX)

    - company size have Small S,medium M, lagre L

2. finidng the missing values and filling it

In [13]:
for col in categorical_cols:
    print(col,df[col].isna().sum())

experience_level 0
employment_type 0
job_title 0
salary_currency 0
employee_residence 0
company_location 0
company_size 0

so no missing values

3. standardizing the values if inconsistent

In [14]:
df[categorical_cols[0]].value_counts()

experience_level
SE    10670
MI     4038
EN     1325
EX      501
Name: count, dtype: int64

In [15]:
df[categorical_cols[1]].value_counts()

employment_type
FT    16454
PT       38
CT       28
FL       14
Name: count, dtype: int64

In [16]:
df[categorical_cols[2]].value_counts()

job_title
Data Engineer                3464
Data Scientist               3314
Data Analyst                 2440
Machine Learning Engineer    1705
Research Scientist            531
                             ...
BI Data Engineer                1
Marketing Data Engineer         1
Data Science Tech Lead          1
Principal Data Architect        1
Cloud Data Architect            1
Name: count, Length: 155, dtype: int64

In [17]:
df[categorical_cols[3]].value_counts()

salary_currency
USD    15294
GBP      616
EUR      449
CAD       56
INR       55
AUD       12
CHF        8
PLN        7
SGD        6
BRL        5
DKK        4
JPY        4
TRY        3
HUF        3
ILS        2
NOK        2
THB        2
PHP        1
NZD        1
HKD        1
ZAR        1
MXN        1
CLP        1
Name: count, dtype: int64

In [18]:
df[categorical_cols[4]].value_counts()

employee_residence
US    14467
GB      686
CA      453
ES      137
DE       98
      ...
IQ        1
BG        1
JE        1
RS        1
LU        1
Name: count, Length: 88, dtype: int64

In [19]:
categorical_cols

['experience_level',
 'employment_type',
 'job_title',
 'salary_currency',
 'employee_residence',
 'company_location',
 'company_size']

In [20]:
df[categorical_cols[5]].value_counts()

company_location
US    14518
GB      694
CA      455
ES      133
DE      105
      ...
DZ        1
IQ        1
CN        1
CL        1
MD        1
Name: count, Length: 77, dtype: int64

In [21]:
df[categorical_cols[6]].value_counts()

company_size
M    15306
L     1040
S      188
Name: count, dtype: int64

Assuming that data has no inconsistent labels here, all are consistent

In [23]:
for col in categorical_cols:
    print(col,df[col].nunique())

experience_level 4
employment_type 4
job_title 155
salary_currency 23
employee_residence 88
company_location 77
company_size 3

except 3 columns ,all have more categories

and that columns are Nominal, we cant make that many dummies which leads many fetaures/dimensions by one hot encoding 

so we have options like grouping, frequency or target encoding

for > categories it best not to do one hot encoding

if tree based lagorithms no need of encoding , but doing Regression model with lines so , we need to do his step correctly



grouping - i will group rarely used categories as one category

Frequency encoding for the other

In [25]:
df['job_title'].value_counts()

job_title
Data Engineer                3464
Data Scientist               3314
Data Analyst                 2440
Machine Learning Engineer    1705
Research Scientist            531
                             ...
BI Data Engineer                1
Marketing Data Engineer         1
Data Science Tech Lead          1
Principal Data Architect        1
Cloud Data Architect            1
Name: count, Length: 155, dtype: int64

In [26]:
threeshold=10

counts = df['job_title'].value_counts()

major_categories = counts[counts>=threeshold].index
major_categories

Index(['Data Engineer', 'Data Scientist', 'Data Analyst',
       'Machine Learning Engineer', 'Research Scientist', 'Applied Scientist',
       'Data Architect', 'Analytics Engineer', 'Research Engineer',
       'Data Science', 'Business Intelligence Engineer', 'Data Manager',
       'ML Engineer', 'Business Intelligence Analyst',
       'Machine Learning Scientist', 'Research Analyst',
       'Data Science Manager', 'AI Engineer', 'Business Intelligence',
       'BI Developer', 'Data Specialist', 'Data Science Consultant',
       'Data Analytics Manager', 'Head of Data',
       'Business Intelligence Developer', 'Data Modeler', 'BI Analyst',
       'Decision Scientist', 'Data Product Manager',
       'Director of Data Science', 'Machine Learning Infrastructure Engineer',
       'Computer Vision Engineer', 'Data Developer', 'Data Science Engineer',
       'AI Architect', 'ETL Developer', 'AI Scientist', 'Data Science Lead',
       'Data Lead', 'Data Strategist', 'Data Operations Analyst',
       'Data Quality Analyst', 'Data Integration Specialist',
       'Data Analytics Lead', 'MLOps Engineer', 'Data Infrastructure Engineer',
       'Data Management Analyst', 'Business Data Analyst',
       'Machine Learning Researcher', 'Business Intelligence Manager',
       'Data Integration Engineer', 'AI Developer', 'BI Data Analyst',
       'NLP Engineer', 'Prompt Engineer', 'Data Science Practitioner',
       'Data Operations Engineer', 'Machine Learning Software Engineer',
       'Data Visualization Specialist', 'Applied Machine Learning Scientist',
       'Insight Analyst', 'Cloud Database Engineer', 'Applied Data Scientist',
       'Big Data Engineer', 'Head of Data Science', 'Robotics Engineer',
       'Deep Learning Engineer', 'Data Operations Specialist',
       'Data Management Specialist', 'Lead Data Scientist',
       'Business Intelligence Lead', 'Principal Data Scientist',
       'Machine Learning Developer'],
      dtype='object', name='job_title')

In [32]:
minor_categories = df[~df['job_title'].isin(major_categories)]['job_title'].unique()
minor_categories

array(['Data Operations Manager', 'AI Software Engineer',
       'Machine Learning Operations Engineer',
       'Encounter Data Management Professional',
       'Data Analytics Specialist', 'Admin & Data Analyst',
       'Consultant Data Engineer', 'Manager Data Management',
       'Data Quality Manager', 'Business Intelligence Specialist',
       'Director of Business Intelligence', 'Data Product Owner',
       'AI Research Scientist', 'Bear Robotics',
       'Data Operations Associate', 'Applied Research Scientist',
       'CRM Data Analyst', 'Data Science Analyst',
       'Data Quality Engineer', 'Computational Biologist',
       'Data Analytics Associate', 'Data Reporting Analyst',
       'Data Management Consultant', 'Robotics Software Engineer',
       'Data DevOps Engineer', 'Data Science Director',
       'Big Data Developer', 'Quantitative Research Analyst',
       'Lead Machine Learning Engineer',
       'Machine Learning Research Engineer', 'Data Analytics Consultant',
       'AI Research Engineer', 'AI Programmer', 'ETL Engineer',
       'AI Product Manager', 'Head of Machine Learning',
       'Data Analyst Lead', 'Data Integration Developer',
       'ML Ops Engineer', 'Data Pipeline Engineer', 'Lead Data Analyst',
       'Managing Director Data Science', 'Marketing Data Scientist',
       'Machine Learning Modeler', 'Financial Data Analyst',
       'Data Strategy Manager', 'Data Visualization Engineer',
       'Azure Data Engineer', 'Staff Data Analyst',
       'Machine Learning Manager', 'Principal Machine Learning Engineer',
       'Principal Data Engineer', 'Power BI Developer',
       'Staff Machine Learning Engineer', 'Staff Data Scientist',
       'Machine Learning Specialist',
       'Business Intelligence Data Analyst', 'Data Modeller',
       'Finance Data Analyst', 'Software Data Engineer',
       'Compliance Data Analyst', 'Cloud Data Engineer',
       'Analytics Engineering Manager', 'AWS Data Architect',
       'Product Data Analyst', 'Data Visualization Analyst',
       'Autonomous Vehicle Technician', 'Sales Data Analyst',
       'Applied Machine Learning Engineer', 'BI Data Engineer',
       'Deep Learning Researcher', 'Big Data Architect',
       'Computer Vision Software Engineer', 'Marketing Data Engineer',
       'Data Science Tech Lead', 'Data Scientist Lead',
       'Marketing Data Analyst', 'Principal Data Architect',
       'Data Analytics Engineer', 'Cloud Data Architect',
       'Lead Data Engineer', 'Principal Data Analyst'], dtype=object)

from above output i extract less frequent and more frequent job

doubts i got

- less frequent job can also give high pay slary so i cant group by thresshold by frequency

- so checking with there mean salary and there frequency

- if low frequency and low salary treting as other , keep high freuency, low frequency and high mean salary

In [ ]:
counts = df['job_title'].value_counts()
avg_salary = df.groupby('job_title')['salary_in_usd'].mean()

threshold = 2
rare_jobs = counts[counts < threshold].index

# keep only top 3 highest-pay rare jobs
k = 3
high_pay_rare_jobs = avg_salary.loc[rare_jobs].sort_values(ascending=False).head(k).index
print(high_pay_rare_jobs)
group_other_jobs = set(rare_jobs) - set(high_pay_rare_jobs)

df['job_title_grouped'] = df['job_title'].replace(list(group_other_jobs), 'Other')

In [37]:
df['job_titlte_grouped'].value_counts()

job_titlte_grouped
Data Engineer                3464
Data Scientist               3314
Data Analyst                 2440
Machine Learning Engineer    1705
Research Scientist            531
                             ...
BI Data Engineer                1
Marketing Data Engineer         1
Data Science Tech Lead          1
Principal Data Architect        1
Cloud Data Architect            1
Name: count, Length: 155, dtype: int64